sCO2Channel-DES_1.03_500_20_coarsestConstProp/system/mirrorMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mirrorMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
planeType           pointAndNormal;

pointAndNormalDict
{
    basePoint       (0 0 0); 
    normalVector    (-1 0 0); 
}

planeTolerance      1e-6;
